namespace _12.Volleyball
{
    using System;

    public class Volleyball
    {
        //// Влади е студент, живее в София и си ходи от време на време до родния град. Той е много запален 
        //// по волейбола, но е зает през работните дни и играе волейбол само през уикендите и в празничните 
        //// дни. Влади играе в София всяка събота, когато не е на работа и не си пътува до родния град, както 
        //// и в 2/3 от празничните дни. Той пътува до родния си град "h" пъти в годината, където играе 
        //// волейбол със старите си приятели в неделя. Влади не е на работа 3/4 от уикендите, в които е в 
        //// София. Отделно, през високосните години Влади играе с 15% повече волейбол от нормалното. 
        //// Приемаме, че годината има точно 48 уикенда, подходящи за волейбол.

        //// Напишете програма, която изчислява колко пъти Влади е играл волейбол през годината.
        //// Закръглете резултата надолу до най-близкото цяло число(например 2.15 -> 2; 9.95 -> 9).

        //// Входните данни се четат от конзолата:
        ////   # Първият ред съдържа думата “leap” (високосна година) или “normal” (невисокосна).
        ////   # Вторият ред съдържа цялото число p – брой празници в годината(които не са събота и неделя).
        ////   # Третият ред съдържа цялото число h – брой уикенди, в които Влади си пътува до родния град.

        //// Пример: Input: normal, 3, 2 -> Output: 38;    Input: leap, 2, 3 -> Output: 43

        public static void Main()
        {
            var year = Console.ReadLine();
            var holidays = int.Parse(Console.ReadLine());
            var weekendsInProvince = int.Parse(Console.ReadLine());

            var weekendsInSofia = (48 - weekendsInProvince) * (3.0 / 4);
            var gamesInHolidays = holidays * (2.0 / 3);
            var allGames = weekendsInSofia + weekendsInProvince + gamesInHolidays;

            if (year == "leap")
            {
                Console.WriteLine(Math.Truncate(allGames + (allGames * 0.15)));
            }
            else
            {
                Console.WriteLine(Math.Truncate(allGames));
            }
        }
    }
}