namespace Lili
{
    using System;

    public class SmartLili
    {
        //// Лили вече е на "N" години. За всеки свой рожден ден тя получава подарък. За нечетните рождени 
        //// дни (1, 3, 5...n) получава играчки, а за всеки четен (2, 4, 6...n) получава пари.

        //// За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв, за всеки следващ 
        //// четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30...и т.н.). През годините Лили тайно е спестявала 
        //// парите. Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях. Лили 
        //// продала играчките получени през годините, всяка за "P" лева и добавила сумата към спестените пари.
        //// С парите искала да си купи пералня за "X" лева. 

        //// Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.

        //// От конзолата се прочитат 3 числа, на отделни редове:
        ////   # Възраста на Лили – цяло число в интервала[1...77]
        ////   # Цената на пералнята – число в интервала[1.00...10 000.00]
        ////   # Единична цена на играчка – цяло число в интервала[0...40]

        //// Да се отпечата на конзолата един ред:
        ////   # Ако парите на Лили са достатъчни: “Yes! {N}” – където N е остатъка пари след покупката
        ////   # Ако парите не са достатъчни: “No! {М}“ – където M е сумата, която не достига
        ////   # Числата N и M трябва да за форматирани до вторият знак след десетичната запетая.

        //// Пример: Input: 10, 170.00, 6 -> Output: Yes! 5.00

        public static void Main()
        {
            var age = int.Parse(Console.ReadLine());
            var washingMachinePrice = double.Parse(Console.ReadLine());
            var toyPrice = int.Parse(Console.ReadLine());

            int money = 0;
            int toys = 0;

            for (int i = 1; i <= age; i++)
            {
                if (i % 2 == 0)
                {
                    money = money + ((i / 2) * 10) - 1;
                }
                else
                {
                    toys++;
                }
            }

            money = money + (toys * toyPrice);

            if (money >= washingMachinePrice)
            {
                Console.WriteLine("Yes! {0:f2}", money - washingMachinePrice);
            }
            else
            {
                Console.WriteLine("No! {0:f2}", Math.Abs(money - washingMachinePrice));
            }
        }
    }
}