namespace Задача_04___Деление_без_остатък
{
    using System;

    public class DivisionWithoutResidue
    {
        //// Четвърта задача от междинния изпит на 26 март 2016. 

        //// Дадени са "n" цели числа в интервала[1…1000]. От тях някакъв процент p1 се делят без остатък на 2,
        //// друг процент p2 се делят без остатък на 3, друг процент p3 се делят без остатък на 4. 
        //// Да се напише програма, която изчислява и отпечатва процентите p1, p2 и p3.

        //// На първия ред от входа стои цялото число "n" (1 ≤ n ≤ 1000) – брой числа. На следващите 
        //// n реда стои по едно цяло число в интервала [1…1000] – числата които да бъдат проверени 
        //// на колко се делят.

        //// Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%, 
        //// с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.
        ////   # На първият ред – процентът на числата които се делят на 2
        ////   # На вторият ред – процентът на числата които се делят на 3
        ////   # На третият ред – процентът на числата които се делят на 4
        
        public static void Main()
        {
            var n = int.Parse(Console.ReadLine());

            var p1 = 0;
            var p2 = 0;
            var p3 = 0;

            for (int i = 0; i < n; i++)
            {
                var num = int.Parse(Console.ReadLine());

                if (num % 2 == 0)
                {
                    p1++;
                }

                if (num % 3 == 0)
                {
                    p2++;
                }

                if (num % 4 == 0)
                {
                    p3++;
                }
            }

            var p1percent = p1 * 100.0 / n;
            var p2percent = p2 * 100.0 / n;
            var p3percent = p3 * 100.0 / n;

            Console.WriteLine("{0:f2}%", p1percent);
            Console.WriteLine("{0:f2}%", p2percent);
            Console.WriteLine("{0:f2}%", p3percent);
        }
    }
}